Repository: iamnalinor/bootcamp-edulink
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: es, pt, zh

source: ‹ Назад
es: ‹ Volver
pt: ‹ Voltar
zh: ‹ 返回

source: :house: Домой
es: :house: Сasa
pt: :house: Início
zh: :house: 家

source: Это имя уже занято. Попробуй добавить номер группы, дату или год обучения.
es: Este nombre ya está en uso. Intenta añadir el número de grupo, la fecha o el año de estudios.
pt: Este nome já está em uso. Tente adicionar um número de grupo, data ou ano de estudo.
zh: 这个名字已经被取走了。 尝试添加组号，日期或学习年份。

source: Нельзя выбирать дату в прошлом. Попробуй ещё раз.
es: No se puede seleccionar una fecha pasada. Inténtalo de nuevo.
pt: Não é possível selecionar uma data no passado. Tente novamente.
zh: 您无法选择过去的日期。 再试一次。

source: Ты можешь хранить решения заданий в <b>контейнерах</b>. Одно задание на группу студентов — один контейнер. После создания можно поделиться ссылкой на контейнер, по которой студенты будут загружать решения. Введи название задания:
es: Puedes guardar las soluciones de las tareas en contenedores. Un contenedor por tarea y grupo de estudiantes. Una vez creado, puedes compartir un enlace al contenedor para que los estudiantes suban sus soluciones. Introduce el nombre de la tarea:
pt: Você pode armazenar soluções de tarefas em <b>contêineres</b>. Uma tarefa para um grupo de estudantes — um contêiner. Após a criação, você pode compartilhar um link para o contêiner, onde os estudantes poderão enviar suas soluções. Digite o nome da tarefa:
zh: 您可以将任务解决方案存储在<b>容器</b>中。 每组学生一个任务是一个容器。 创建后，您可以共享指向容器的链接，学生将在其中上传解决方案。 输入任务的名称:

source: Введи описание задания:
es: Introduce la descripción de la tarea:
pt: Digite a descrição da tarefa:
zh: 输入任务描述:

source: Пропустить
es: Omitir
pt: Pular
zh: 跳过

source: :calendar: Выбери срок задания. Дедлайн наступит в 23:59 МСК в этот день:
es: :calendar: Selecciona la fecha límite de la tarea. La fecha de entrega será a las 23:59 (hora de Moscú) de ese día:
pt: :calendar: Escolha o prazo da tarefa. O prazo final será às 23:59 MSK neste dia:
zh: :calendar: 选择任务的截止日期。 截止日期将在莫斯科时间23:59在这一天。:

source: Всё готово! Нажми на кнопку, чтобы завершить создание.
es: ¡Todo listo! Haz clic en el botón para finalizar la creación.
pt: Tudo pronto! Clique no botão para finalizar a criação.
zh: 一切都准备好了！ 点击按钮完成创建。

source: :fire: Создать контейнер
es: :fire: Crear contenedor
pt: :fire: Criar contêiner
zh: :fire: 创建容器

source: Размер файла должен быть не больше {n} МБ.
es: El tamaño del archivo no debe superar los {n} MB.
pt: O tamanho do arquivo não deve exceder {n} MB.
zh: 文件大小不得超过{n}兆字节。

source: Неверное имя файла.
es: Nombre de archivo no válido.
pt: Nome de arquivo inválido.
zh: 无效的文件名。

source: Обработка... Это займет до 30 секунд.
es: Procesando... Tardará hasta 30 segundos.
pt: Processando... Isso levará até 30 segundos.
zh: 处理。.. 最多需要30秒。

source: Отправлено! ID решения — <code>{homework.id}</code>
es: ¡Publicado! El ID de la solución es <code>{homework.id}</code>
pt: Enviado! ID da solução — <code>{homework.id}</code>
zh: 发送！ 解决方案ID —<code>{homework.id}</code>

source: :package: <b>Доступные контейнеры</b>
es: :paquete: <b>Contenedores disponibles</b>
pt: :package: <b>Contêineres disponíveis</b>
zh: :package: <b>可用容器</b>

source: :package: <b>Контейнер {{ container.name }}</b> › Просмотр {% if container.is_archived %}:lock: Архивирован {% elif container.deadline %}Дедлайн <b>{{ container.deadline.strftime('%d.%m.%Y') }} 23:59 МСК</b> {% endif %} {% if container.description %}<blockquote expandable>{{ container.description }}</blockquote> {% endif %} {% if homework_sent %}:white_check_mark: Отправлено решение под ID <code>{{ homework_sent.id }}</code> {% endif %}
es: :package: <b>Contenedor {{ container.name }}</b> › Miramos {% if container.is_archived %}:lock: Archivado {% elif container.deadline %}Fecha límite <b>{{ container.deadline.strftime('%d.%m.%Y') }} 23:59 (+3 GMT)</b> {% endif %} {% if container.description %}<blockquote expandable>{{ container.description }}</blockquote> {% endif %} {% if homework_sent %}:white_check_mark: Solución enviada bajo ID <code>{{ homework_sent.id }}</code> {% endif %}
pt: :package: <b>Contêiner {{ container.name }}</b> › Visualização {% if container.is_archived %}:lock: Arquivado {% elif container.deadline %}Prazo final <b>{{ container.deadline.strftime('%d.%m.%Y') }} 23:59 MSK</b> {% endif %} {% if container.description %}<blockquote expandable>{{ container.description }}</blockquote> {% endif %} {% if homework_sent %}:white_check_mark: Solução enviada com ID <code>{{ homework_sent.id }}</code> {% endif %}
zh: :package: <b>货柜 {{ container.name }}</b> › 查看 {% if container.is_archived %}:lock: 存档 {% elif container.deadline %}截止日期 <b>{{ container.deadline.strftime('%d.%m.%Y') }} 23:59 莫斯科时间</b> {% endif %} {% if container.description %}<blockquote expandable>{{ container.description }}</blockquote> {% endif %} {% if homework_sent %}:white_check_mark: 解决方案与ID一起提交 <code>{{ homework_sent.id }}</code> {% endif %}

source: :heavy_plus_sign: Загрузить решение
es: :heavy_plus_sign: Descargar solución
pt: :heavy_plus_sign: Carregar solução
zh: :heavy_plus_sign: 上传解决方案

source: :mailbox_with_mail: Решения
es: :mailbox_with_mail: Decisión
pt: :mailbox_with_mail: Soluções
zh: :mailbox_with_mail: 决定

source: :link: Поделиться ссылкой
es: :link: Compartir enlace
pt: :link: Compartilhar link
zh: :link: 共享链接

source: :lock: Архивировать
es: :lock: Archivar
pt: :lock: Arquivar
zh: :lock: 档案库

source: Присоединиться к контейнеру {{ container.name }} можно по ссылке: {{ invite_link }}
es: Unirse al contenedor {{ container.name }} puede hacer referencia a: {{ invite_link }}
pt: Você pode se juntar ao contêiner {{ container.name }} pelo link: {{ invite_link }}
zh: 加入容器 {{ container.name }} 您可以按照链接: {{ invite_link }}

source: :warning: Ты хочешь архивировать контейнер <b>{{ container.name }}</b>. Он будет скрыт у студентов. Ты уверен? Это действие нельзя отменить.
es: :warning: Quieres archivar un contenedor <b>{{ container.name }}</b>. Se ocultará a los estudiantes. ¿Estás seguro? Esta acción no se puede deshacer.
pt: :warning: Você quer arquivar o contêiner <b>{{ container.name }}</b>. Ele ficará oculto para os estudantes. Você tem certeza? Esta ação não pode ser desfeita.
zh: :warning: 你想存档容器吗 <b>{{ container.name }}</b>. 它将对学生隐藏。 你肯定吗？ 此操作无法撤消。

source: Да, я уверен
es: Sí, estoy seguro
pt: Sim, tenho certeza
zh: 是的，我确定

source: :memo: Отправь решение задания текстом или файлом до {limit} МБ.
es: :memo: Envíe la solución de trabajo por texto o archivo a {limit} МB.
pt: :memo: Envie a solução da tarefa como texto ou arquivo até {limit} MB.
zh: :memo: 前以文本或文件形式发送任务解决方案 {limit} 兆字节.

source: Выгружаем решения. Это займёт некоторое время
es: Descargando soluciones. Tomará algún tiempo
pt: Baixando soluções. Isso levará algum tempo
zh: 上传解决方案。 这需要一些时间

source: Оценка должна быть целым неотрицательным числом.
es: La calificación debe ser un número entero no negativo.
pt: A nota deve ser um número inteiro não negativo.
zh: 分数必须是非负整数。

source: Время отправки
es: Tiempo de envío
pt: Hora do envio
zh: 提交时间

source: ФИО
es: Nombre y apellidos
pt: Nome completo
zh: 全名

source: Имя файла
es: Nombre del archivo
pt: Nome do arquivo
zh: 文件名

source: Оценка
es: Calificación
pt: Nota
zh: 分数

source: Незачёт
es: No aprobado
pt: Reprovado
zh: 不及格

source: :package: <b>Доступные задания</b>
es: :package: <b>Trabajos disponibles</b>
pt: :package: <b>Tarefas disponíveis</b>
zh: :package: <b>可用任务</b>

source: :inbox_tray: Скачать файлы
es: :inbox_tray: Descargar archivos
pt: :inbox_tray: Baixar arquivos
zh: :inbox_tray: 下载文件

source: :hash: Скачать таблицу
es: :hash: Descargar tabla
pt: :hash: Baixar tabela
zh: :hash: 下载表格

source: :package: <b>Контейнер {{ container.name }} › Решение {{ homework.id }}</b> Отправил {{ homework.owner.fio }} в {{ created_at }} {% if homework.text %} <blockquote expandable>{{ homework.text }}</blockquote> {% endif %} {% if homework.mark == -1 %} :no_entry: <b>Выставлен незачёт</b> {% elif homework.mark %} :hash: <b>Выставлена оценка {{ homework.mark }}</b> {% endif %}
es: :package: <b>Contenedor {{ container.name }} › Decision {{ homework.id }}</b> Envie {{ homework.owner.fio }} в {{ created_at }} {% if homework.text %} <blockquote expandable>{{ homework.text }}</blockquote> {% endif %} {% if homework.mark == -1 %} :no_entry: <b>Se ha marcado como no aprobado</b> {% elif homework.mark %} :hash: <b>Se ha asignado una calificación de {{ homework.mark }}</b> {% endif %}
pt: :package: <b>Contêiner {{ container.name }} › Solução {{ homework.id }}</b> Enviado por {{ homework.owner.fio }} em {{ created_at }} {% if homework.text %} <blockquote expandable>{{ homework.text }}</blockquote> {% endif %} {% if homework.mark == -1 %} :no_entry: <b>Reprovado</b> {% elif homework.mark %} :hash: <b>Nota atribuída {{ homework.mark }}</b> {% endif %}
zh: :package: <b>货柜 {{ container.name }} › 决定 {{ homework.id }}</b> 发送 {{ homework.owner.fio }} 在 {{ created_at }} {% if homework.text %} <blockquote expandable>{{ homework.text }}</blockquote> {% endif %} {% if homework.mark == -1 %} :no_entry: <b>未通过</b> {% elif homework.mark %} :hash: <b>评分为 {{ homework.mark }}</b> {% endif %}

source: :hash: Выставить оценку
es: :hash: Asignar calificación
pt: :hash: Atribuir nota
zh: :hash: 评分

source: :hash: Введи оценку целым числом:
es: :hash: Introduce la calificación como un número entero:
pt: :hash: Digite a nota como um número inteiro:
zh: :hash: 请输入整数分数:

source: :no_entry: Незачёт
pt: :no_entry: Reprovado
zh: :no_entry: 不及格

source: Добро пожаловать в EduLink! Введи своё ФИО. Пример: Иванов Иван Иванович
es: Bienvenido a EduLink! Introduce tu nombre. Ejemplo: Ivanov Ivan Ivanovich
pt: Bem-vindo ao EduLink! Digite seu nome completo. Exemplo: João Silva Santos
zh: 欢迎来到 EduLink! 输入您的全名。 例如：成龍

source: :party_popper: Ты зарегистрировался!
es: :party_popper: ¡Estás registrado!
pt: :party_popper: Você se registrou!
zh: :party_popper: 你已经报名了！

source: :gear: Настройки
es: :gear: Ajustes
pt: :gear: Configurações
zh: :gear: 设置

source: :white_flag: Изменить язык
es: :white_flag: Cambiar idioma
pt: :white_flag: Alterar idioma
zh: :white_flag: 更改语言

source: :white_flag: Выбери язык:
es: :white_flag: Elige tu idioma:
pt: :white_flag: Escolha o idioma:
zh: :white_flag: 选择一种语言:

source: Установлен язык {locale.flag} {locale.name}. Ты можешь изменить его по команде /settings.
es: Se establece el idioma {locale.flag} {locale.name}. Puedes cambiarlo con el comando /settings.
pt: Idioma definido para {locale.flag} {locale.name}. Você pode alterá-lo usando o comando /settings.
zh: 语言已设置 {locale.flag} {locale.name}. 您可以根据命令更改它。/settings.

source: Ты уже находишься в этом контейнере.
es: Ya estás en ese contenedor.
pt: Você já está neste contêiner.
zh: 你已经在这个容器里了。

source: Ты присоединился к контейнеру {container.name}!
es: Te uniste al contenedor {container.name}!
pt: Você se juntou ao contêiner {container.name}!
zh: 你加入集装箱了 {container.name}!

source: Контейнер не найден.
es: Contenedor no encontrado.
pt: Contêiner não encontrado.
zh: 未找到容器。

source: Привет, {first_name}! <a href='{figma_url}'>Открыть макет в Figma</a>
es: Hola, {first_name}! <a href='{figma_url}'>Abrir diseño en Figma</a>
pt: Olá, {first_name}! <a href='{figma_url}'>Abrir layout no Figma</a>
zh: 嗨。, {first_name}! <a href='{figma_url}'>在Figma中打开布局</a>

source: :heavy_plus_sign: Новый контейнер
es: :heavy_plus_sign: nuevo contenedor
pt: :heavy_plus_sign: Novo contêiner
zh: :heavy_plus_sign: 新容器

source: :package: Контейнеры
es: :package: Contenedores
pt: :package: Contêineres
zh: :package: 货柜
